{
  "id": "7ae7da84-bc74-4e29-af7c-0f2f2c3337f6",
  "slug": "four-townships",
  "title": "The Four Townships",
  "content": {
    "root": {
      "props": {
        "title": "The Four Townships"
      }
    },
    "zones": {},
    "content": [
      {
        "type": "Hero",
        "props": {
          "id": "townships-hero",
          "title": "The Four Townships",
          "description": "Bishopdale is comprised of four historic townships, each with its own distinct character and heritage. Together they form a unique community in the heart of the Yorkshire Dales."
        }
      },
      {
        "type": "TextBlock",
        "props": {
          "id": "townships-intro",
          "content": "The ecclesiastical parish of Thoralby encompasses four distinct townships that have shared a common history for centuries. This medieval administrative structure reflects the traditional organization of rural Yorkshire, where scattered settlements were grouped together for ecclesiastical and civil purposes.\n\nWhile each township maintained its own identity and local customs, they were united through the parish church at Thoralby and shared responsibilities for maintaining roads, supporting the poor, and other communal obligations."
        }
      },
      {
        "type": "CardGrid",
        "props": {
          "id": "townships-grid",
          "cards": [
            {
              "title": "Thoralby",
              "content": "The largest of the four townships, home to St. Oswald's Church with its Norman architecture from the 12th century. Notable features include the village green, historic stone cottages, and The George Inn."
            },
            {
              "title": "Newbiggin",
              "content": "A scattered hamlet whose name means \"new building,\" reflecting its origins as a medieval settlement. Known for traditional farmsteads, medieval field patterns, and stone barns."
            },
            {
              "title": "Bishopdale",
              "content": "The valley that gives its name to the wider area, known for its distinctive landscape and farming heritage. Features include Bishopdale Beck, ancient field boundaries, and traditional hay meadows."
            },
            {
              "title": "West Burton",
              "content": "A picturesque village with one of the largest village greens in England. Renowned for its waterfall (Cauldron Falls), market cross, and stone bridges."
            }
          ]
        }
      },
      {
        "type": "InfoSection",
        "props": {
          "id": "townships-conclusion",
          "title": "Community Through the Ages",
          "bgColor": "gradient",
          "content": "The four townships have shared centuries of history, from medieval farming practices to the social changes of the Industrial Revolution and beyond. Each community contributed to the broader life of the dale through agriculture, crafts, and trade.\n\nThe people of these townships have long been connected through family ties, shared work on the land, and participation in parish life. Church records, estate documents, and census returns reveal the intricate web of relationships that bound these communities together.\n\nToday, while modern administrative boundaries have evolved, the four townships remain linked by their shared heritage and the enduring beauty of the Bishopdale landscape."
        }
      },
      {
        "type": "InfoSection",
        "props": {
          "id": "InfoSection-dbff1c5a-24f5-4d88-a2c2-14aa2eafb491",
          "title": "New section",
          "bgColor": "gradient",
          "content": "The four townships have shared centuries of history, from medieval farming practices to the social changes of the Industrial Revolution and beyond. Each community contributed to the broader life of the dale through agriculture, crafts, and trade.\n\nThe people of these townships have long been connected through family ties, shared work on the land, and participation in parish life. Church records, estate documents, and census returns reveal the intricate web of relationships that bound these communities together.\n\nToday, while modern administrative boundaries have evolved, the four townships remain linked by their shared heritage and the enduring beauty of the Bishopdale landscape."
        }
      }
    ]
  },
  "published": true,
  "created_at": "2025-11-07T15:14:11.962214+00:00",
  "updated_at": "2025-11-07T17:28:26.850372+00:00"
}