{
  "id": "bfc1d63d-56d0-4adb-9bc0-030564fef54c",
  "slug": "thoralby",
  "title": "Thoralby",
  "content": {
    "root": {
      "props": {
        "title": "Thoralby"
      }
    },
    "content": [
      {
        "type": "Hero",
        "props": {
          "id": "thoralby-hero",
          "title": "Thoralby",
          "imageSrc": "https://images.pexels.com/photos/208518/pexels-photo-208518.jpeg",
          "description": "The heart of Bishopdale, a historic village with centuries of stories woven into its stone cottages and surrounding landscape."
        }
      },
      {
        "type": "TextBlock",
        "props": {
          "id": "thoralby-intro",
          "content": "Thoralby is the principal settlement in Bishopdale, one of the quieter side valleys of Wensleydale in the Yorkshire Dales National Park. The village has maintained its agricultural character while preserving a rich heritage that spans from medieval times to the present day."
        }
      },
      {
        "type": "FeatureCard",
        "props": {
          "id": "feature-church",
          "icon": "Book",
          "title": "St. Oswald's Church",
          "iconBg": "sage",
          "content": "The Parish Church of St. Oswald stands as Thoralby's most significant historical landmark. Dating from the 12th century, the church features Norman architecture with later additions from various periods. The church has served as the spiritual heart of the four townships for over 800 years.\n\nThe building contains fascinating architectural details including medieval stonework, historical monuments, and records that provide invaluable insights into the lives of generations of Bishopdale residents."
        }
      },
      {
        "type": "FeatureCard",
        "props": {
          "id": "feature-village",
          "icon": "Map",
          "title": "The Village",
          "iconBg": "parchment",
          "content": "Thoralby's layout reflects its agricultural heritage, with stone cottages clustered around the church and along narrow lanes. Many buildings date from the 17th and 18th centuries, built from the local limestone that characterizes Yorkshire Dales architecture.\n\nThe village green and surrounding farms create a traditional Dales landscape that has changed remarkably little over the centuries. Historic features include the George Inn, traditional stone barns, and dry-stone walls that define the field patterns."
        }
      },
      {
        "type": "FeatureCard",
        "props": {
          "id": "feature-farming",
          "icon": "Users",
          "title": "Farming Heritage",
          "iconBg": "sage",
          "content": "For centuries, Thoralby's economy and way of life have been intimately connected to farming and sheep rearing. The village lies at the heart of traditional hill farming country, where generations of families have worked the land and tended flocks on the surrounding fells.\n\nThe annual agricultural cycle shaped community life, from lambing in spring to haymaking in summer and sheep sales in autumn. This farming tradition continues today, maintaining the landscape and rural character that define Thoralby."
        }
      },
      {
        "type": "CardGrid",
        "props": {
          "id": "thoralby-features",
          "cards": [
            {
              "title": "Historic Buildings",
              "description": "Stone cottages and farmhouses dating from the 17th-19th centuries, showcasing traditional Yorkshire Dales architecture and craftsmanship."
            },
            {
              "title": "Community Life",
              "description": "A close-knit community that has maintained its traditions while welcoming visitors who appreciate its quiet beauty and heritage."
            },
            {
              "title": "Natural Setting",
              "description": "Surrounded by beautiful fell country with ancient field patterns, dry-stone walls, and traditional hay meadows characteristic of the Yorkshire Dales."
            }
          ],
          "title": "Notable Features"
        }
      },
      {
        "type": "InfoSection",
        "props": {
          "id": "thoralby-today",
          "title": "Thoralby Today",
          "bgColor": "gradient",
          "content": "Modern Thoralby retains its rural character and strong sense of community. While farming remains important, the village has adapted to changing times, with residents engaged in diverse occupations while maintaining traditional values.\n\nThe village serves as a gateway for walkers exploring the Yorkshire Dales, with numerous footpaths leading into the surrounding countryside. Visitors are drawn to Thoralby's unspoiled character, historic church, and the peaceful beauty of Bishopdale.\n\nDespite modern changes, Thoralby remains recognizably connected to its past, with many families maintaining ties to the area stretching back generations. The village continues to be a living community rather than a museum piece, balancing preservation of heritage with the needs of contemporary life."
        }
      }
    ]
  },
  "published": true,
  "created_at": "2025-11-09T12:41:24.522983+00:00",
  "updated_at": "2025-11-09T12:51:43.217917+00:00"
}